spikeyamk/ESP32_AD5933/fw/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=16384
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=96
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_SIZE=512
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=84
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_SIZE=1280
CONFIG_BT_NIMBLE_MSYS_BUF_FROM_HEAP=n
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=96
CONFIG_BT_NIMBLE_TRANSPORT_ACL_SIZE=1000
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=280
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=120
CONFIG_BT_NIMBLE_TRANSPORT_EVT_DISCARD_COUNT=32
CONFIG_FREERTOS_HZ=1000
CONFIG_PTHREAD_TASK_PRIO_DEFAULT=0
